HM2_Case1/simulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       13900;
    }
    base
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       14400;
    }
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       14700;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       15900;
    }
)

// ************************************************************************* //
